In [4]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
data = {
    'nombre': ['Juan', 'Ana', 'Luis', 'Maria', 'Pedro'],
    'apellido': ['Perez', 'Lopez', 'Gonzalez', 'Rodriguez', 'Martinez'],
    'edad': [30, 28, 40, 35, 45],
    'salario': [50000, 55000, 70000, 65000, 80000],
    'departamento': ['Ventas', 'Marketing', 'Finanzas', 'Ventas', 'Recursos Humanos']
}

df = pd.DataFrame(data)
display(df)

  nombre   apellido  edad  salario      departamento
0   Juan      Perez    30    50000            Ventas
1    Ana      Lopez    28    55000         Marketing
2   Luis   Gonzalez    40    70000          Finanzas
3  Maria  Rodriguez    35    65000            Ventas
4  Pedro   Martinez    45    80000  Recursos Humanos

In [6]:
#creacion de engine es para instanciar la basse de datos
engine = create_engine('sqlite:///empelados.db')
#guardar la base de datos
df.to_sql('empleados', con=engine, if_exists='replace', index=False)

5

In [8]:
#leer datos almacenados en la tabla
result_df = pd.read_sql('SELECT * FROM empleados', con=engine)
display(result_df)

  nombre   apellido  edad  salario      departamento
0   Juan      Perez    30    50000            Ventas
1    Ana      Lopez    28    55000         Marketing
2   Luis   Gonzalez    40    70000          Finanzas
3  Maria  Rodriguez    35    65000            Ventas
4  Pedro   Martinez    45    80000  Recursos Humanos

In [10]:
#consultas mas complejas
query = """
SELECT nombre, apellido, salario
FROM empleados
WHERE salario > 60000
"""

result_df_filtrado = pd.read_sql(query, con=engine)
display(result_df_filtrado)

  nombre   apellido  salario
0   Luis   Gonzalez    70000
1  Maria  Rodriguez    65000
2  Pedro   Martinez    80000